#ifndef ANIM_DSG_H
#define ANIM_DSG_H

#include <QObject>
#include <QWidget>
#include <QPainter>
#include <QMouseEvent>
#include <qDebug>
#include <QVector>


static int anim[6][10][2]={
//    {{240,175},{240,224},{240,273},{240,322},{240,371},{240,420},{240,469},{240,518},{240,567},{240,616}},//I
//    {{389,165},{297,121},{210,177},{146,278},{222,363},{297,414},{379,484},{327,584},{210,626},{124,571}},//S
//    {{84,197},{416,186},{127,247},{367,246},{187,315},{321,316},{253,375},{253,455},{253,544},{253,625}},//Y
//    {{389,165},{297,121},{210,177},{146,278},{222,263},{297,414},{379,484},{327,584},{210,626},{124,571}},//S
//    {{125,212},{363,212},{126,322},{363,322},{126,430},{365,430},{147,557},{342,560},{206,635},{287,632}},//U
//    {{240,175},{240,224},{240,273},{240,322},{240,371},{240,420},{240,469},{240,518},{240,567},{240,616}}//I
    {{134,251},{134,366},{134,478},{134,592},{203,366},{274,366},{346,251},{346,366},{346,478},{346,592}},//H
    {{121,255},{199,255},{277,255},{355,255},{277,363},{199,476},{121,581},{199,581},{277,581},{355,581}},//Z
    {{134,366},{134,251},{134,592},{134,478},{274,366},{203,366},{346,366},{346,251},{346,592},{346,478}},//H




};
static int org[10][2]={
    {68,268},{219,245},{345,247},{129,357},{132,458},{197,459},{161,599},{228,584},{274,572},{356,553}
};
//static float M[]={-2.63336129e-01,-3.20519109e-01,5.76439103e+02,6.78691469e-02,-1.68005122,2.63186714e+03,1.11574255e-04,-1.56065564e-03,1};
static float M[]={ 5.22950431e+00, -1.24760735e+00 , 2.69046024e+02,4.86413851e-01 ,-7.05885350e-01 ,1.57740849e+03,1.75646476e-04 ,-9.62443095e-04,1.00000000e+00};
class anim_dsg : public QWidget
{
    Q_OBJECT
public:
    anim_dsg();
    QVector<float> cvt_point(QVector<float> src);

protected:
    void paintEvent(QPaintEvent *event);

protected:
    //鼠标点击事件
    void mousePressEvent(QMouseEvent* ev)override
    {
        if(ev->button()==Qt::LeftButton)//这里判断，是否是鼠标左键按下，只有左键按下窗口才能移动
        {
            pos=ev->pos();//用成员变量记录下按下左键时鼠标的坐标
            qDebug()<<pos.x()<<pos.y();
        }
    }
    //鼠标移动事件
    void mouseMoveEvent(QMouseEvent*ev)override
    {
        if(ev->buttons()==Qt::LeftButton)//注意，这里用的是buttons，因为buttons里存储了之前的按键信息
        {
            int x,y;
            x=ev->pos().x()-pos.x();
            y=ev->pos().y()-pos.y();
            this->move(this->x()+x,this->y()+y);
        }
    }

    void set_step(int step);//0-90
protected:
    void wheelEvent(QWheelEvent *event);
    QPoint pos;
    int now_anim[10][2];
    int now_step;

};

#endif // ANIM_DSG_H
